FILES/Catalogs/ДополнительныеКомандыВводНаОсновании.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.5">
	<Catalog>
		<Properties>
			<Name>ДополнительныеКомандыВводНаОсновании</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Использовать</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВнешняяОбработка</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НаименованиеОбработки</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>250</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РежимОтладки</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПутьКФайлуОтладки</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Вид</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДополнительныйФункционал</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ДополнительныйФункционал</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>СписокОбъектов</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ПредставлениеОбъекта</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПутьКОбъектуМетаданных</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>СписокКоманд</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Использовать</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Представление</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>50</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Обработчик</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Идентификатор</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>МножественныйВыбор</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Менеджер</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>РежимЗаписи</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

FILES/CommonModules/МодульМенеджераОбъектыСервер/Ext/Module.bsl
Процедура ОбработкаПолученияФормы(ТипМодуля = "", ВидФормы, Параметры, ВыбраннаяФорма, ДополнительнаяИнформация, СтандартнаяОбработка, ДополнительноеДействие) Экспорт
	МаркетПлейсВызовСервера.ОбработкаПолученияФормы(ТипМодуля, ВидФормы, Параметры, ВыбраннаяФорма, ДополнительнаяИнформация, СтандартнаяОбработка, ДополнительноеДействие);
КонецПроцедуры

Процедура ОбработкаПолученияДанныхВыбора(ТипМодуля = "", ДанныеВыбора, Параметры, СтандартнаяОбработка, ДополнительноеДействие) Экспорт
	
	МаркетПлейсВызовСервера.ОбработкаПолученияДанныхВыбора(ТипМодуля, ДанныеВыбора, Параметры, СтандартнаяОбработка, ДополнительноеДействие);
	
КонецПроцедуры

Процедура ОбработкаПолученияПолейПредставления(ТипМодуля = "", Поля, СтандартнаяОбработка, ДополнительноеДействие) Экспорт
	
	МаркетПлейсВызовСервера.ОбработкаПолученияПолейПредставления(ТипМодуля, Поля, СтандартнаяОбработка, ДополнительноеДействие);
	
КонецПроцедуры

Процедура ОбработкаПолученияПредставления(ТипМодуля = "", Данные, Представление, СтандартнаяОбработка, ДополнительноеДействие) Экспорт
	
	МаркетПлейсВызовСервера.ОбработкаПолученияПредставления(ТипМодуля, Данные, Представление, СтандартнаяОбработка, ДополнительноеДействие);
	
КонецПроцедуры



Процедура ДобавитьКомандыОтчетов(Модуль, КомандыОтчетов) Экспорт
	//
КонецПроцедуры

Процедура ДобавитьКомандыПечати(Модуль, КомандыПечати) Экспорт
	//
КонецПроцедуры

Процедура ДобавитьКомандыСозданияНаОсновании(Модуль, КомандыСоздатьНаОсновании) Экспорт
	//
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ РАЗЛИЧНЫЕ
	               |	ДополнительныеКомандыВводНаОснованииСписокОбъектов.Ссылка КАК Ссылка
	               |ПОМЕСТИТЬ ДопКоманды
	               |ИЗ
	               |	Справочник.ДополнительныеКомандыВводНаОсновании.СписокОбъектов КАК ДополнительныеКомандыВводНаОснованииСписокОбъектов
	               |ГДЕ
	               |	ДополнительныеКомандыВводНаОснованииСписокОбъектов.ПредставлениеОбъекта ПОДОБНО &ПредставлениеОбъекта
	               |	И ДополнительныеКомандыВводНаОснованииСписокОбъектов.Ссылка.Использовать = ИСТИНА
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ДополнительныеКомандыВводНаОснованииСписокКоманд.Ссылка КАК Ссылка,
	               |	ДополнительныеКомандыВводНаОснованииСписокКоманд.НомерСтроки КАК НомерСтроки,
	               |	ДополнительныеКомандыВводНаОснованииСписокКоманд.Использовать КАК Использовать,
	               |	ДополнительныеКомандыВводНаОснованииСписокКоманд.Представление КАК Представление,
	               |	ДополнительныеКомандыВводНаОснованииСписокКоманд.Обработчик КАК Обработчик,
	               |	ДополнительныеКомандыВводНаОснованииСписокКоманд.Идентификатор КАК Идентификатор,
	               |	ДополнительныеКомандыВводНаОснованииСписокКоманд.МножественныйВыбор КАК МножественныйВыбор,
	               |	ДополнительныеКомандыВводНаОснованииСписокКоманд.Менеджер КАК Менеджер,
	               |	ДополнительныеКомандыВводНаОснованииСписокКоманд.РежимЗаписи КАК РежимЗаписи
	               |ИЗ
	               |	Справочник.ДополнительныеКомандыВводНаОсновании.СписокКоманд КАК ДополнительныеКомандыВводНаОснованииСписокКоманд
	               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ДопКоманды КАК ДопКоманды
	               |		ПО ДополнительныеКомандыВводНаОснованииСписокКоманд.Ссылка = ДопКоманды.Ссылка
	               |ГДЕ
	               |	ДополнительныеКомандыВводНаОснованииСписокКоманд.Использовать = ИСТИНА";
	Запрос.УстановитьПараметр("ПредставлениеОбъекта", Модуль);
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл
		НоваяКоманда = КомандыСоздатьНаОсновании.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяКоманда, Выборка);
	КонецЦикла;
	
КонецПроцедуры
